Tekla Open API Reference for Tekla Structures 2025
Size Properties
The Size type exposes the following members.
Properties
Name | Description
Height
 Gets or sets the height value of the size instance.
Width
 Gets or sets the width value of the size instance.
Top
See Also
Reference
Size Class
Tekla.Structures.Drawing Namespace